app/controllers/course_modules_controller.rb

  def index
    @course_modules = CourseModule.all
---
SELECT `course_modules`.* FROM `course_modules`