app/controllers/courses_controller.rb

  def index
    @courses = Course.all
---
SELECT `courses`.* FROM `courses`

  def create
    @course = Course.new(course_params)

    respond_to do |format|
      if @course.save
---
INSERT INTO `courses` (`description`, `created_at`, `updated_at`) VALUES ('ADS', '2016-11-19 12:51:35', '2016-11-19 12:51:35')