app/controllers/plane_classrooms_controller.rb

  def index
    @plane_classrooms = PlaneClassroom.where(teacher_id: @teacher.id)
---
SELECT `plane_classrooms`.* FROM `plane_classrooms` WHERE `plane_classrooms`.`teacher_id` = 2

    def set_teacher
      @teacher = Teacher.where(email: current_user.email).first
---
SELECT  `teachers`.* FROM `teachers` WHERE `teachers`.`email` = 'wendreoofernandes@gmail.com'  ORDER BY `teachers`.`id` ASC LIMIT 1