app/controllers/teachers_controller.rb

SELECT `teachers`.* FROM `teachers`
---
  def index
    @teachers = Teacher.all

INSERT INTO `teachers` (`registration`, `name`, `email`, `created_at`, `updated_at`) VALUES ('123213', 'abcv', 'eqeqwe@wewqewq', '2016-11-29 17:10:05', '2016-11-29 17:10:05')
---
  def create
    @teacher = Teacher.new(teacher_params)

    respond_to do |format|
      if @teacher.save