app/views/plane_classrooms/_form.html.erb

          <div class="col-lg-10">
            <%= f.collection_select :course_id, Course.all, :id, :description, {:prompt => 'Selecione um curso', :selected => @plane_classroom.course_id}, {:class => 'form-control'} %>
---
SELECT `courses`.* FROM `courses`

          <div class="col-lg-10">
            <%= f.collection_select :study_unit_id, StudyUnit.all, :id, :description, {:prompt => 'Selecione uma unidade', :selected => @plane_classroom.study_unit_id}, {:class => 'form-control'} %>
---
SELECT `study_units`.* FROM `study_units`